app/controllers/admin/animals_controller.rb

  def index
    @animals = Animal.all
---
SELECT * FROM "animals"

  def show
    @animal = Animal.find(params[:id])
---
SELECT * FROM "animals" WHERE ("animals"."id" = 1)

  def edit
    @animal = Animal.find(params[:id])
---
SELECT * FROM "animals" WHERE ("animals"."id" = 1)

  def create
    @animal = Animal.new(params[:animal])

    respond_to do |format|
      if @animal.save
---
INSERT INTO "animals" ("classificacao", "idate", "created_at", "photo_file_size", "usuario_id", "nome", "updated_at", "photo_file_name", "porte", "photo_content_type", "tipo_id", "raca_id", "photo_updated_at", "castrado", "vacinado", "descricao", "status", "vermifugado") VALUES(0, 1, '2010-12-03 01:35:53', NULL, NULL, 'asd1', '2010-12-03 01:35:53', NULL, '1', NULL, 1, NULL, NULL, 't', 'f', '1', 'f', 't')

  def update
    @animal = Animal.find(params[:id])

    respond_to do |format|
      if @animal.update_attributes(params[:animal])
---
SELECT * FROM "animals" WHERE ("animals"."id" = 4)
UPDATE "animals" SET "updated_at" = '2010-12-01 00:10:57', "porte" = 'grande', "descricao" = 'Cachorro Dócil e Brincalhão.', "vermifugado" = 't', "idate" = 1, "vacinado" = 't', "castrado" = 't', "nome" = 'Thor' WHERE "id" = 1

  def destroy
    @animal = Animal.find(params[:id])
    @animal.destroy
---
SELECT * FROM "animals" WHERE ("animals"."id" = 4)
DELETE FROM "animals" WHERE "id" = 4