app/controllers/main_controller.rb

SELECT * FROM "tipos"
---
  def index
    @tipos = Tipo.all